In [1]:
import pandas as pd

In [12]:
s=pd.Series([1,3,5,7,9])
print(s)
print(s[2])

0    1
1    3
2    5
3    7
4    9
dtype: int64
5

In [13]:
dic = {'a':1, 'b':3, 'c':5}
s=pd.Series(dic)
print(s)
print(s['b'])

a    1
b    3
c    5
dtype: int64
3

In [14]:
print(s.values)
print(s.index)

[1 3 5]
Index(['a', 'b', 'c'], dtype='object')

In [7]:
s = pd.Series([1,3,5,7,9], index=['LGT','DOO','HWE','LOT','SKW'])
print(s)
print(s['LOT'])
print(s[:'LOT'])

LGT    1
DOO    3
HWE    5
LOT    7
SKW    9
dtype: int64
7
LGT    1
DOO    3
HWE    5
LOT    7
dtype: int64

In [11]:
score ={'학번':[1524213, 1621223,1621233],
        '이름':['오지환','박용택','정성훈'],
        'Quiz':[15,20,10],
        '중간고사':[20,20,15]}
score_df = pd.DataFrame(score)
score_df

        학번   이름  Quiz  중간고사
0  1524213  오지환    15    20
1  1621223  박용택    20    20
2  1621233  정성훈    10    15

In [15]:
print(type(score_df['학번']))
score_df['학번']

<class 'pandas.core.series.Series'>

0    1524213
1    1621223
2    1621233
Name: 학번, dtype: int64

In [16]:
d = {
'Name': ['Alisa', 'Bobby', 'Cathrine', 'Madonna', 'Rocky', 'Sebastian', 'Jaqluine', 'Rahul', 'David', 'Andrew', 'Ajay', 'Teresa'], 'Age': [26,27,25,24,31,27,25,33,42,32,51,47], 'Score': [89,87,67,55,47,72,76,79,44,92,99,69]}
df = pd.DataFrame(d)

In [17]:
df

         Name  Age  Score
0       Alisa   26     89
1       Bobby   27     87
2    Cathrine   25     67
3     Madonna   24     55
4       Rocky   31     47
5   Sebastian   27     72
6    Jaqluine   25     76
7       Rahul   33     79
8       David   42     44
9      Andrew   32     92
10       Ajay   51     99
11     Teresa   47     69

In [18]:
df['Age']

0     26
1     27
2     25
3     24
4     31
5     27
6     25
7     33
8     42
9     32
10    51
11    47
Name: Age, dtype: int64

In [19]:
df[['Name','Age']]

         Name  Age
0       Alisa   26
1       Bobby   27
2    Cathrine   25
3     Madonna   24
4       Rocky   31
5   Sebastian   27
6    Jaqluine   25
7       Rahul   33
8       David   42
9      Andrew   32
10       Ajay   51
11     Teresa   47

In [20]:
type(df['Name'])

pandas.core.series.Series

In [21]:
type(df[['Name']])

pandas.core.frame.DataFrame

In [22]:
df[0:3]

       Name  Age  Score
0     Alisa   26     89
1     Bobby   27     87
2  Cathrine   25     67

In [23]:
df=df.reindex([1,4,6,2,3,5,9,8,0,7,11,10])
df

         Name  Age  Score
1       Bobby   27     87
4       Rocky   31     47
6    Jaqluine   25     76
2    Cathrine   25     67
3     Madonna   24     55
5   Sebastian   27     72
9      Andrew   32     92
8       David   42     44
0       Alisa   26     89
7       Rahul   33     79
11     Teresa   47     69
10       Ajay   51     99

In [24]:
df.loc[:6]

       Name  Age  Score
1     Bobby   27     87
4     Rocky   31     47
6  Jaqluine   25     76

In [25]:
df.iloc[:6]

        Name  Age  Score
1      Bobby   27     87
4      Rocky   31     47
6   Jaqluine   25     76
2   Cathrine   25     67
3    Madonna   24     55
5  Sebastian   27     72

In [26]:
df1 = df.sort_index()
df1

         Name  Age  Score
0       Alisa   26     89
1       Bobby   27     87
2    Cathrine   25     67
3     Madonna   24     55
4       Rocky   31     47
5   Sebastian   27     72
6    Jaqluine   25     76
7       Rahul   33     79
8       David   42     44
9      Andrew   32     92
10       Ajay   51     99
11     Teresa   47     69

In [27]:
df1.loc[:6]

        Name  Age  Score
0      Alisa   26     89
1      Bobby   27     87
2   Cathrine   25     67
3    Madonna   24     55
4      Rocky   31     47
5  Sebastian   27     72
6   Jaqluine   25     76

In [28]:
df1.iloc[:6]

        Name  Age  Score
0      Alisa   26     89
1      Bobby   27     87
2   Cathrine   25     67
3    Madonna   24     55
4      Rocky   31     47
5  Sebastian   27     72

In [31]:
df2  = df.sort_index(ascending=False)
df2

         Name  Age  Score
11     Teresa   47     69
10       Ajay   51     99
9      Andrew   32     92
8       David   42     44
7       Rahul   33     79
6    Jaqluine   25     76
5   Sebastian   27     72
4       Rocky   31     47
3     Madonna   24     55
2    Cathrine   25     67
1       Bobby   27     87
0       Alisa   26     89

In [32]:
df2.iloc[:,2]

11    69
10    99
9     92
8     44
7     79
6     76
5     72
4     47
3     55
2     67
1     87
0     89
Name: Score, dtype: int64

In [33]:
df2.loc[:,['Name','Age']]

         Name  Age
11     Teresa   47
10       Ajay   51
9      Andrew   32
8       David   42
7       Rahul   33
6    Jaqluine   25
5   Sebastian   27
4       Rocky   31
3     Madonna   24
2    Cathrine   25
1       Bobby   27
0       Alisa   26

In [36]:
df2.iloc[:,:2]

         Name  Age
11     Teresa   47
10       Ajay   51
9      Andrew   32
8       David   42
7       Rahul   33
6    Jaqluine   25
5   Sebastian   27
4       Rocky   31
3     Madonna   24
2    Cathrine   25
1       Bobby   27
0       Alisa   26

In [37]:
df2.loc[:,'Age']

11    47
10    51
9     32
8     42
7     33
6     25
5     27
4     31
3     24
2     25
1     27
0     26
Name: Age, dtype: int64

In [38]:
df = pd.read_csv('RegularSeasonCompactResults.csv')

In [39]:
df.head()

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0
3    1985      25     1165      70     1432      54    H      0
4    1985      25     1192      86     1447      74    H      0

In [40]:
df.tail()

        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
156084    2018     132     1153      56     1222      55    N      0
156085    2018     132     1172      58     1348      57    N      0
156086    2018     132     1209      74     1426      61    N      0
156087    2018     132     1246      77     1397      72    N      0
156088    2018     132     1335      68     1217      65    N      0

In [41]:
df.shape

(156089, 8)

In [42]:
df.columns.tolist()

['Season', 'DayNum', 'WTeamID', 'WScore', 'LTeamID', 'LScore', 'WLoc', 'NumOT']

In [43]:
df.describe()

,Season,DayNum,WTeamID,WScore,LTeamID,LScore,NumOT
count,156089.000000,156089.000000,156089.000000,156089.000000,156089.000000,156089.000000,156089.000000
mean,2002.676749,74.916106,1286.911044,76.756895,1282.612727,64.654095,0.046627
std,9.783024,33.468727,104.560253,12.109720,104.728288,11.368591,0.253754
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2003.000000,77.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2011.000000,103.000000,1380.000000,84.000000,1375.000000,72.000000,0.000000
max,2018.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [44]:
df.max()

Season     2018
DayNum      132
WTeamID    1464
WScore      186
LTeamID    1464
LScore      150
WLoc          N
NumOT         6
dtype: object

In [45]:
df['WScore'].max()

186

In [46]:
df['LScore'].mean()

64.65409477926055

In [47]:
df['WScore'].argmax()

24970

In [48]:
df.loc[24970]

Season     1991
DayNum       68
WTeamID    1258
WScore      186
LTeamID    1109
LScore      140
WLoc          H
NumOT         0
Name: 24970, dtype: object

In [49]:
df.loc[df['WScore'].idxmax()]

Season     1991
DayNum       68
WTeamID    1258
WScore      186
LTeamID    1109
LScore      140
WLoc          H
NumOT         0
Name: 24970, dtype: object

In [61]:
df['Season'].value_counts()

2018    5405
2017    5395
2016    5369
2014    5362
2015    5354
2013    5320
2010    5263
2012    5253
2009    5249
2011    5246
2008    5163
2007    5043
2006    4757
2005    4675
2003    4616
2004    4571
2002    4555
2000    4519
2001    4467
1999    4222
1998    4167
1997    4155
1992    4127
1991    4123
1996    4122
1995    4077
1994    4060
1990    4045
1989    4037
1993    3982
1988    3955
1987    3915
1986    3783
1985    3737
Name: Season, dtype: int64

In [62]:
Wscore = df['WScore']
Wscore.head()

0    81
1    77
2    63
3    70
4    86
Name: WScore, dtype: int64

In [65]:
df.loc[[df['WScore'].idxmax()]]

       Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
24970    1991      68     1258     186     1109     140    H      0

In [66]:
df.loc[df['WScore'].idxmax()]

Season     1991
DayNum       68
WTeamID    1258
WScore      186
LTeamID    1109
LScore      140
WLoc          H
NumOT         0
Name: 24970, dtype: object

In [68]:
df.loc[[df['WScore'].idxmax()]]['LScore']

24970    140
Name: LScore, dtype: int64

In [69]:
df.loc[df['WScore'].idxmax()]['LScore']

140

In [70]:
df.loc[df['WScore'].idxmax(), 'LScore']

140

In [71]:
type(df.loc[[df['WScore'].idxmax()]]['LScore'])

pandas.core.series.Series

In [73]:
type(df.loc[[df['WScore'].idxmax()]])

pandas.core.frame.DataFrame

In [74]:
df.sort_values('LScore').head()

        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
100027    2008      66     1203      49     1387      20    H      0
49310     1997      66     1157      61     1204      21    H      0
89021     2006      44     1284      41     1343      21    A      0
103660    2009      26     1326      59     1359      22    H      0
85042     2005      66     1131      73     1216      22    H      0

In [82]:
print(type(df['WScore'] >150))
(df['WScore'] > 150).head()

<class 'pandas.core.series.Series'>

0    False
1    False
2    False
3    False
4    False
Name: WScore, dtype: bool

In [83]:
df[df['WScore'] > 150].head()

       Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
5269     1986      75     1258     151     1109     107    H      0
12046    1988      40     1328     152     1147      84    H      0
12355    1988      52     1328     151     1173      99    N      0
16040    1989      40     1328     152     1331     122    H      0
16853    1989      68     1258     162     1109     144    A      0

In [84]:
df[(df['WScore'] > 150) & (df['LScore'] < 100)]

       Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
12046    1988      40     1328     152     1147      84    H      0
12355    1988      52     1328     151     1173      99    N      0
25656    1991      84     1106     151     1212      97    H      0
28687    1992      54     1261     159     1319      86    H      0
35023    1993     112     1380     155     1341      91    A      0
52600    1998      33     1395     153     1410      87    H      0

In [85]:
df.groupby('WTeamID')['WScore'].mean().head()

WTeamID
1101    76.666667
1102    70.407295
1103    76.048561
1104    75.795981
1105    74.923913
Name: WScore, dtype: float64

In [88]:
df.groupby('WTeamID')['WLoc'].value_counts().head(9)

WTeamID  WLoc
1101     H        22
         A        13
         N         4
1102     H       220
         A        76
         N        33
1103     H       347
         A       162
         N        47
Name: WLoc, dtype: int64

In [89]:
print(type(df.values))
print(df.values.shape)
df.values

<class 'numpy.ndarray'>
(156089, 8)

array([[1985, 20, 1228, ..., 64, 'N', 0],
       [1985, 25, 1106, ..., 70, 'H', 0],
       [1985, 25, 1112, ..., 56, 'H', 0],
       ...,
       [2018, 132, 1209, ..., 61, 'N', 0],
       [2018, 132, 1246, ..., 72, 'N', 0],
       [2018, 132, 1335, ..., 65, 'N', 0]], dtype=object)

In [90]:
df.values[0,0]

1985

In [94]:
for index, row in df.iterrows():
    print('#Data type of row', type(row))
    print(row)
    if index == 1:
        break

#Data type of row <class 'pandas.core.series.Series'>
Season     1985
DayNum       20
WTeamID    1228
WScore       81
LTeamID    1328
LScore       64
WLoc          N
NumOT         0
Name: 0, dtype: object
#Data type of row <class 'pandas.core.series.Series'>
Season     1985
DayNum       25
WTeamID    1106
WScore       77
LTeamID    1354
LScore       70
WLoc          H
NumOT         0
Name: 1, dtype: object

In [95]:
df.isnull().sum()

Season     0
DayNum     0
WTeamID    0
WScore     0
LTeamID    0
LScore     0
WLoc       0
NumOT      0
dtype: int64

In [99]:
df.to_csv('test.csv', index=False)
df2 = pd.read_csv('test.csv')
df2.head()

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0
3    1985      25     1165      70     1432      54    H      0
4    1985      25     1192      86     1447      74    H      0

In [100]:
df.to_csv('test.csv')
df2 = pd.read_csv('test.csv', index_col=0)
df2.head()

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0
3    1985      25     1165      70     1432      54    H      0
4    1985      25     1192      86     1447      74    H      0